Repository: hussainshahzad350/liaqat-kiryana-store-pos
Catalog: lib/l10n/app_*.arb
Languages: ur

# appTitle
source: Liaqat Kiryana Store
ur: لیاقت کریانہ اسٹور

source: POS System
ur: پوائنٹ آف سیل سسٹم

# posVersion
source: POS System v1.0
ur: POS سسٹم v1.0

source: Login
ur: لاگ ان

source: Password
ur: پاسورڈ

source: Forgot Password?
ur: پاسورڈ بھول گئے؟

source: Home
ur: ہوم

source: Sales / POS
ur: فروخت / POS

source: Stock Management
ur: اسٹاک مینیجمنٹ

source: Master Data
ur: ماسٹر ڈیٹا

source: Reports
ur: رپورٹس

source: Cash Ledger
ur: کیش لیجر

source: Settings
ur: سیٹنگز

source: About App
ur: ایپ کے بارے میں

source: Logout
ur: لاگ آؤٹ

source: Generate Bill
ur: بل بنائیں

# todaySales
source: Today's Sales
ur: آج کی فروخت

# todayCustomers
source: Today's Customers
ur: آج کے گاہک

source: No customers today
ur: آج کوئی گاہک نہیں آیا

source: Low Stock
ur: کم اسٹاک

# allStockAvailable
source: All items in stock
ur: سب آئٹمز اسٹاک میں ہیں

source: Recent Sales
ur: حالیہ سیلز

source: No sales yet
ur: ابھی تک کوئی فروخت نہیں ہوئی

source: Customer
ur: گاہک

source: Amount
ur: رقم

source: Item
ur: آئٹم

source: Current
ur: موجودہ

source: Required
ur: ضرورت

source: Items
ur: آئٹمز

source: Customers
ur: کسٹمرز

source: Suppliers
ur: سپلائرز

source: Categories
ur: کیٹیگریز

source: Units
ur: یونٹس

source: Items Management
ur: آئٹمز مینیجمنٹ

source: Search Item
ur: آئٹم تلاش کریں

source: No items found
ur: کوئی آئٹم نہیں ملا

source: Add New Item
ur: نیا آئٹم شامل کریں

source: English Name
ur: انگریزی نام

source: Urdu Name
ur: اردو نام

source: Sale Price
ur: قیمت فروخت

source: Initial Stock
ur: ابتدائی اسٹاک

source: Stock
ur: اسٹاک

source: Price
ur: قیمت

source: Save
ur: محفوظ کریں

source: Cancel
ur: منسوخ

source: Edit Item
ur: آئٹم میں ترمیم کریں

source: Stock Update
ur: اسٹاک اپڈیٹ

source: Update
ur: اپڈیٹ کریں

source: Confirmation
ur: تصدیق

# deleteItemConfirm
source: Are you sure you want to delete this item?
ur: کیا آپ واقعی اس آئٹم کو حذف کرنا چاہتے ہیں؟

source: Yes, Delete
ur: ہاں، حذف کریں

source: No
ur: نہیں

source: Item deleted
ur: آئٹم حذف ہو گیا

source: Error
ur: خرابی

source: Purchase
ur: خریداری

source: Sales
ur: فروخت

source: Stock View
ur: اسٹاک ویو

source: New Purchase
ur: نئی خریداری

source: Select Supplier
ur: سپلائر منتخب کریں

source: Choose Supplier
ur: سپلائر چنیں

source: Add Item
ur: آئٹم شامل کریں

source: Quantity
ur: مقدار

source: Total
ur: کل

source: Additional Charges
ur: اضافی اخراجات

source: Transport
ur: ٹرانسپورٹ

source: Labor
ur: مزدوری

source: Save Purchase
ur: خریداری محفوظ کریں

source: Sales Record
ur: فروخت کا ریکارڈ

# allSalesVisibleHere
source: All sales will be visible here
ur: یہاں آپ کی تمام فروخت نظر آئے گی

source: Make New Sale
ur: نئی فروخت کریں

source: Search Stock
ur: اسٹاک تلاش کریں

source: Total Items
ur: کل آئٹمز

source: Stock Value
ur: اسٹاک ویلیو

source: Stock Details
ur: اسٹاک کی تفصیل

source: Unit
ur: یونٹ

source: Action
ur: عمل

source: Adjust Stock
ur: اسٹاک ایڈجسٹ کریں

source: Download Report
ur: رپورٹ ڈاؤنلوڈ کریں

source: Profit
ur: منافع

source: Customer Balance
ur: کسٹمر بیلنس

source: Date Selection
ur: تاریخ کا انتخاب

source: Start Date
ur: شروع تاریخ

source: End Date
ur: اختتام تاریخ

source: to
ur: سے

source: Comparison
ur: مقابلہ

# thisMonthVsLast
source: This Month vs Last Month
ur: اس مہینہ بمقابلہ پچھلے مہینہ

source: Total Sales
ur: کل فروخت

source: Daily Average
ur: اوسط روزانہ

source: Total Bills
ur: کل بل

source: Sales Graph
ur: فروخت کا گراف

source: Detailed Sales
ur: تفصیلی فروخت

# billNumber
source: Bill #
ur: بل نمبر

source: Cash
ur: کیش

source: Bank
ur: بینک

source: Credit
ur: کریڈٹ

source: Profit Summary
ur: منافع کا خلاصہ

source: Total Cost
ur: کل لاگت

source: Net Profit
ur: خالص منافع

# profitPercentage
source: Profit %
ur: منافع فیصد

# avgProfitPerBill
source: Avg Profit/Bill
ur: اوسط منافع فی بل

source: Expenses Breakdown
ur: اخراجات کی تفصیل

source: Purchase Cost
ur: خریداری لاگت

source: Other Expenses
ur: دیگر اخراجات

source: Total Expenses
ur: کل اخراجات

source: Monthly Profit
ur: ماہانہ منافع

source: Purchase Report
ur: خریداری رپورٹ

# allPurchasesVisibleHere
source: All purchases will be visible here
ur: یہاں آپ کی تمام خریداری نظر آئے گی

source: Customer Balance Summary
ur: کسٹمر بیلنس کا خلاصہ

source: Total Balance
ur: کل بیلنس

source: Avg Balance
ur: اوسط بیلنس

source: Balance Aging
ur: بیلنس ایجنگ

source: Days
ur: دن

source: Old
ur: پرانا

source: Top Balance Customers
ur: سب سے زیادہ بیلنس والے کسٹمرز

source: Stock Value Summary
ur: اسٹاک ویلیو کا خلاصہ

source: Avg Price
ur: اوسط قیمت

# categoryStock
source: Category-wise Stock
ur: کیٹیگری کے لحاظ سے اسٹاک

source: Low Stock Items
ur: کم اسٹاک آئٹمز

source: Full Report
ur: مکمل رپورٹ

source: Shop Profile
ur: شاپ پروفائل

source: Backup
ur: بیک اپ

source: Receipt Format
ur: رسید فارمیٹ

source: Preferences
ur: ترجیحات

source: About
ur: اینڈرول

source: Change Logo
ur: لوگو تبدیل کریں

source: Remove
ur: ہٹائیں

source: Shop Details
ur: دکان کی تفصیلات

source: Shop Name (Urdu)
ur: دکان کا نام (اردو)

source: Shop Name (English)
ur: دکان کا نام (انگریزی)

source: Address
ur: پتہ

source: Primary Phone
ur: پرائمری فون

source: Secondary Phone
ur: سیکنڈری فون

source: Save Changes
ur: تبدیلیاں محفوظ کریں

source: Current Database
ur: موجودہ ڈیٹا بیس

source: Size
ur: سائز

source: Last Backup
ur: آخری بیک اپ

source: Backup Options
ur: بیک اپ کے اختیارات

source: Create Backup Now
ur: ابھی بیک اپ بنائیں

source: Export to USB
ur: USB پر ایکسپورٹ کریں

source: Import from USB
ur: USB سے امپورٹ کریں

source: Recent Backups
ur: حالیہ بیک اپس

source: Open Folder
ur: فولڈر کھولیں

source: Restore
ur: بحال کریں

source: Delete
ur: حذف کریں

source: Receipt Options
ur: رسید کے اختیارات

source: Show Logo
ur: لوگو دکھائیں

source: Show Shop Address
ur: دکان کا پتہ دکھائیں

# showPhone
source: Show Phone Number
ur: فون نمبر دکھائیں

source: Show Date & Time
ur: تاریخ اور وقت دکھائیں

source: Show Customer Details
ur: کسٹمر کی تفصیل دکھائیں

source: Show Payment Details
ur: پیمنٹ کی تفصیل دکھائیں

source: Font Size
ur: فونٹ سائز

source: Paper Width
ur: کاغذ کی چوڑائی

source: Printer Settings
ur: پرنٹر سیٹنگز

source: Select Printer
ur: پرنٹر کا انتخاب

source: Print Test Receipt
ur: ٹیسٹ رسید پرنٹ کریں

source: Receipt Preview
ur: رسید کا پیش نظارہ

# languageAndRegion
source: Language & Region
ur: زبان اور علاقہ

source: App Language
ur: ایپ کی زبان

source: Date Format
ur: تاریخ کا فارمیٹ

source: Currency Symbol
ur: کرنسی کا نشان

source: Before
ur: پہلے

source: After
ur: بعد میں

source: Security
ur: سیکورٹی

# requirePasswordStartup
source: Require Password on Startup
ur: شروع میں پاسورڈ ضروری ہے

# lockAfter5Min
source: Lock after 5 min inactivity
ur: 5 منٹ کی غیر فعالیت کے بعد لاک کریں

source: Auto Backup
ur: آٹو بیک اپ

source: Enable Auto Backup
ur: آٹو بیک اپ فعال کریں

source: Frequency
ur: فریکوئنسی

source: Time
ur: وقت

source: Notifications
ur: اطلاعات

source: Low Stock Alert
ur: کم اسٹاک الرٹ

source: Day Close Reminder
ur: دن بند کرنے کی یاددہانی

# backupSuccessNotify
source: Backup Success Notification
ur: بیک اپ کامیابی کی اطلاع

# updateAvailableNotify
source: Update Available Notification
ur: اپ ڈیٹ دستیاب کی اطلاع

source: Sound Effects
ur: آواز کے اثرات

source: Popup Notifications
ur: پاپ اپ اطلاعات

source: Save Preferences
ur: ترجیحات محفوظ کریں

source: Version
ur: ورژن

source: Check for Updates
ur: اپ ڈیٹس چیک کریں

source: Developed By
ur: توسیع کی گئی

# systemInfo
source: System Information
ur: سسٹم کی معلومات

# dbVersion
source: Database Version
ur: ڈیٹا بیس ورژن

source: Total Suppliers
ur: کل سپلائرز

source: App Uptime
ur: ایپ اپ ٹائم

source: Last Login
ur: آخری لاگ ان

source: Maintenance
ur: دیکھ بھال

# repairDb
source: Repair Database
ur: ڈیٹا بیس مرمت کریں

source: Archive Old Data
ur: پرانا ڈیٹا محفوظ کریں

source: Clear Cache
ur: کیش صاف کریں

source: View Logs
ur: لاگز دیکھیں

source: Support
ur: سپورٹ

source: Email
ur: ای میل

source: Phone
ur: فون

source: View Online Guide
ur: آن لائن گائیڈ دیکھیں

source: All Rights Reserved
ur: تمام حقوق محفوظ ہیں

# posTitle
source: POS Terminal
ur: پوائنٹ آف سیل

# searchItemHint
source: Search Item / Scan Barcode
ur: آئٹم تلاش کریں / بارکوڈ اسکین کریں

# searchCustomerHint
source: Search Customer
ur: گاہک تلاش کریں

# walkInCustomer
source: Walk-in
ur: واک ان (عام گاہک)

source: Cart Empty
ur: کارٹ خالی ہے

source: Subtotal
ur: سب ٹوٹل

source: Prev Balance
ur: سابقہ بیلنس

source: Grand Total
ur: کل رقم

# checkoutButton
source: CHECKOUT
ur: چیک آؤٹ

source: Bill Total
ur: بل کی کل رقم

# paymentLabel
source: Payment:
ur: ادائیگی:

# cashInput
source: Cash
ur: نقد (Cash)

# bankInput
source: Bank Transfer
ur: بینک ٹرانسفر

# creditInput
source: Credit (Udhar)
ur: ادھار (Credit)

source: CONFIRM SALE
ur: سیل مکمل کریں

# clearCartTitle
source: Clear Cart?
ur: کارٹ خالی کریں؟

# clearCartMsg
source: This will remove all items from cart.
ur: تمام آئٹمز کارٹ سے ہٹا دیے جائیں گے۔

source: Clear All
ur: سب صاف کریں

# unsavedTitle
source: Unsaved Items
ur: غیر محفوظ شدہ آئٹمز

# unsavedMsg
source: There are items in cart. Are you sure you want to exit without checkout?
ur: کارٹ میں آئٹمز موجود ہیں۔ کیا آپ چیک آؤٹ کیے بغیر نکلنا چاہتے ہیں؟

source: Exit
ur: باہر نکلیں

source: Add New Customer
ur: نیا گاہک شامل کریں

source: Name (English)*
ur: نام (انگریزی)*

source: Name (Urdu)
ur: نام (اردو)

# phoneNum
source: Phone Number*
ur: فون نمبر*

source: Credit Limit
ur: کریڈٹ کی حد

source: Save & Select
ur: محفوظ اور منتخب کریں

source: Qty
ur: تعداد

# currBal
source: Bal
ur: بیلنس

source: Change Return
ur: بقایا واپسی

source: Insufficient payment
ur: ناکافی رقم

# paymentMatch
source: Payment matches bill total
ur: ادائیگی بل کے برابر ہے

# deleteBillTitle
source: Delete Bill?
ur: بل حذف کریں؟

# deleteBillMsg
source: This will restore stock and adjust customer balance.
ur: اس سے اسٹاک بحال اور گاہک کا بیلنس درست ہو جائے گا۔

# saleCompleted
source: Sale Completed! Bill:
ur: سیل مکمل! بل نمبر:

source: Total Customers
ur: کل کسٹمرز

# nameRequired
source: English Name is required
ur: انگریزی نام لکھنا ضروری ہے

# phoneRequired
source: Phone Number is required
ur: فون نمبر لکھنا ضروری ہے

# phoneExists
source: Phone number already exists
ur: یہ فون نمبر پہلے سے موجود ہے

# customerAdded
source: Customer added successfully
ur: گاہک کامیابی سے شامل ہو گیا

source: Customers Management
ur: کسٹمر مینیجمنٹ

source: Receivable (Total)
ur: قابل وصول (کل)

source: Receivable (Active)
ur: قابل وصول (فعال)

source: Receivable (Archived)
ur: قابل وصول (محفوظ شدہ)

source: Archived
ur: محفوظ شدہ (Archived)

source: Active
ur: فعال

source: History
ur: تاریخچہ

source: Edit Customer
ur: کسٹمر کو ایڈٹ کریں

source: Archive Customer
ur: کسٹمر کو آرکائیو کریں

source: Restore Customer
ur: کسٹمر کو بحال کریں

# deleteConfirmMsg
source: Are you sure you want to delete this customer?
ur: کیا آپ واقعی اس کسٹمر کو حذف کرنا چاہتے ہیں؟

# archiveConfirmMsg
source: This will hide the customer from active lists.
ur: یہ کسٹمر کو فعال فہرست سے چھپا دے گا۔

# customerUpdated
source: Customer updated successfully
ur: کسٹمر کامیابی سے اپ ڈیٹ ہو گیا

source: Customer deleted
ur: کسٹمر حذف ہو گیا

source: Customer archived
ur: کسٹمر آرکائیو ہو گیا

source: Customer restored
ur: کسٹمر بحال ہو گیا

# restoreConfirmMsg
source: This will restore the customer to the active list.
ur: یہ کسٹمر کو دوبارہ فعال فہرست میں شامل کر دے گا۔

# restoreAction
source: Restore
ur: بحال کریں

# archiveCustomerTitle
source: Archive Customer?
ur: کسٹمر آرکائیو کریں؟

# restoreCustomerTitle
source: Restore Customer?
ur: کسٹمر بحال کریں؟

# customerNameRequired
source: Name (English) is required
ur: انگریزی نام لکھنا ضروری ہے

# customerAddedSuccess
source: Customer added successfully
ur: کسٹمر کامیابی سے شامل ہو گیا

# customerUpdatedSuccess
source: Customer updated successfully
ur: کسٹمر کامیابی سے اپ ڈیٹ ہو گیا

# cannotDeleteTitle
source: Cannot Delete Customer
ur: حذف نہیں کر سکتے

# deleteWarningSales
source: Has {count} sales records.
ur: فروخت کے {count} ریکارڈز موجود ہیں۔

# deleteWarningBalance
source: Balance is not 0 (RS {balance}) .
ur: بیلنس 0 نہیں ہے (RS {balance})

# deleteWarningReason
source: Deleting them would corrupt your financial reports.
ur: انہیں حذف کرنے سے آپ کی مالی رپورٹس خراب ہو جائیں گی

# deleteWarningArchive
source: Please 'Archive' them instead.
ur: براہ کرم انہیں 'آرکائیو' کر دیں۔

# deleteCustomerTitle
source: Delete Customer?
ur: کسٹمر حذف کریں؟

# deleteCustomerWarning
source: Are you sure you want to permanently delete '{name}'?
ur: کیا آپ واقعی '{name}'کو مستقل طور پر حذف کرنا چاہتے ہیں؟

# deleteAction
source: Delete
ur: حذف کریں

source: OK
ur: ٹھیک ہے

# archiveAction
source: Archive
ur: آرکائیو

source: Do you want to
ur: کیا آپ کرنا چاہتے ہیں

source: this customer
ur: اس گاہک کو

source: will be archived
ur: آرکائیو ہو جائے گا

# cannotDeleteReason
source: Cannot delete customer with existing sales or non-zero balance.
ur: موجودہ فروخت یا غیر صفر بیلنس والے کسٹمر کو حذف نہیں کیا جا سکتا۔

source: Actions
ur: عمل

# customerCard
source: Customer Card ID
ur: گاہک کارڈ آئی ڈی

# generateCard
source: Generate ID
ur: آئی ڈی بنائیں

# viewBarcode
source: View/Print Barcode
ur: بارکوڈ دیکھیں/پرنٹ کریں

source: Print Receipt
ur: رسید پرنٹ کریں

# cancelBillAction
source: Cancel Bill
ur: بل منسوخ کریں

# billCancelled
source: Bill cancelled and stock restored.
ur: بل منسوخ کر دیا گیا اور اسٹاک بحال کر دیا گیا

source: VOIDED
ur: منسوخ شدہ

source: None
ur: کوئی نہیں

source: Print Card
ur: کارڈ پرنٹ کریں

# customerPhoto
source: Photo
ur: تصویر

# saveAndPrint
source: Save & Print
ur: محفوظ اور پرنٹ کریں

# tapToPick
source: Tap to add photo
ur: تصویر شامل کریں

source: Camera
ur: کیمرہ

source: Gallery
ur: گیلری

source: Admin Access
ur: ایڈمن ایکسس

source: Sale
ur: سیلز (فروخت)

# itemsNeedReordering
source: {count} items need reordering.
ur: {count} آئٹمز ختم ہونے والے ہیں۔

source: Quick Actions
ur: فوری ایکشن

source: New Sale
ur: نئی سیل

source: View Reports
ur: رپورٹس دیکھیں

source: Manage Stock
ur: اسٹاک مینیج کریں

source: View All
ur: سب دیکھیں

source: Unknown Bill
ur: نامعلوم بل

# copyright
source: Â© 2024 Liaqat Kiryana Store
ur: © 2024 لیاقت کریانہ سٹور

source: Tap to see details
ur: تفصیلات دیکھنے کے لیے کلک کریں

source: Loading
ur: لوڈ ہو رہا ہے

# mon
source: Monday
ur: سوموار

# tue
source: Tuesday
ur: منگل

# wed
source: Wednesday
ur: بدھ

# thu
source: Thursday
ur: جمعرات

# fri
source: Friday
ur: جمعہ

# sat
source: Saturday
ur: ہفتہ

# sun
source: Sunday
ur: اتوار

# jan
source: January
ur: جنوری

# feb
source: February
ur: فروری

# mar
source: March
ur: مارچ

# apr
source: April
ur: اپریل

source: May
ur: مئی

# jun
source: June
ur: جون

# jul
source: July
ur: جولائی

# aug
source: August
ur: اگست

# sep
source: September
ur: ستمبر

# oct
source: October
ur: اکتوبر

# nov
source: November
ur: نومبر

# dec
source: December
ur: دسمبر

source: Current Bill
ur: موجودہ بل

# billSaved
source: Bill Saved Successfully
ur: بل کامیابی سے محفوظ ہو گیا

source: Checkout
ur: چیک آؤٹ

source: Discount
ur: رعایت

source: Confirm
ur: تصدیق

# confirmDeleteItem
source: Are you sure you want to delete this item?
ur: کیا آپ واقعی اس آئٹم کو حذف کرنا چاہتے ہيں؟

source: Unknown
ur: نامعلوم

# salesHistoryNote
source: Your sales history will appear here
ur: یہاں آپ کی تمام فروخت نظر آئے گی

source: Suppliers Management
ur: سپلائرز مينيجمنٹ

source: Add Supplier
ur: سپلائر شامل کریں

source: Edit Supplier
ur: سپلائر میں ترمیم کریں

source: No suppliers found
ur: کوئی سپلائر نہیں ملا

# supplierAdded
source: Supplier added successfully
ur: سپلائر کامیابی سے شامل ہو گیا

# supplierUpdated
source: Supplier updated successfully
ur: سپلائر کامیابی سے اپڈیٹ ہو گیا

# supplierDeleted
source: Supplier deleted successfully
ur: سپلائر کامیابی سے حذف ہو گیا

# confirmDeleteSupplier
source: Are you sure you want to delete this supplier?
ur: کیا آپ واقعی اس سپلائر کو حذف کرنا چاہتے ہیں؟

source: Balance
ur: بیلنس

source: Select Date
ur: تاریخ کا انتخاب

# thisWeekVsLast
source: This Week vs Last Week
ur: اس ہفتہ بمقابلہ پچھلے ہفتہ

# thisYearVsLast
source: This Year vs Last Year
ur: اس سال بمقابلہ پچھلے سال

source: Avg Daily
ur: اوسط روزانہ

# graphPlaceholder
source: Sales Graph will appear here
ur: یہاں فروخت کا گراف آئے گا

source: Print Report
ur: پرنٹ کریں

source: Date
ur: تاریخ

source: Bill No
ur: بل نمبر

# expenseDetails
source: Expenses Details
ur: اخراجات کی تفصیل

# purchaseHistoryNote
source: Your purchase history will appear here
ur: یہاں آپ کی تمام خریداری نظر آئے گی

source: Top Customers Balance
ur: سب سے زیادہ بیلنس والے کسٹمرز

source: days old
ur: دن پرانا

source: Total Stock Value
ur: کل اسٹاک ویلیو

source: Stock by Category
ur: کیٹیگری کے لحاظ سے اسٹاک

source: Small
ur: چھوٹا

source: Medium
ur: درمیانہ

source: Large
ur: بڑا

source: Daily
ur: روزانہ

source: Weekly
ur: ہفتہ وار

source: Monthly
ur: ماہانہ

# printerDefault
source: Default
ur: ڈیفالٹ

# printerUsb
source: USB Thermal
ur: USB تھرمل

# printerNetwork
source: Network
ur: نیٹ ورک

# shopNamePlaceholder
source: Liaqat Kiryana Store
ur: لیاقت کریانہ سٹور

# addressPlaceholder
source: Lahore, Pakistan
ur: لاہور، پاکستان

source: Bill
ur: بل

source: Deleted Successfully
ur: کامیابی سے ختم ہو گیا ہے

source: End of List
ur: فہرست کا اختتام

source: No customers found
ur: کوئی گاہک نہیں ملا

source: Search
ur: تلاش کریں

# errorProcessingSale
source: Error processing sale: {error}
ur: فروخت کے عمل میں خرابی: {error}

source: New Cash In
ur: نیا کیش ان

source: New Cash Out
ur: نیا کیش آؤٹ

source: Description
ur: تفصیل

source: Remarks
ur: تبصرے

source: Current Balance
ur: موجودہ بیلنس

source: No Data
ur: کوئی ڈیٹا نہیں ملا

source: Cash In
ur: کیش ان

source: Cash Out
ur: کیش آؤٹ

# errorNegativeValues
source: Invalid input: Negative values are not allowed.
ur: غلط اندراج: منفی اقدار کی اجازت نہیں ہے۔

source: Cancel Sale
ur: سیل منسوخ کریں

# cancelSaleTitle
source: Confirm Sale Cancellation
ur: سیل منسوخی کی تصدیق

# cancelSaleMessage
source: Are you sure you want to cancel this sale?
ur: کیا آپ واقعی اس سیل کو منسوخ کرنا چاہتے ہیں؟

# cancelSaleWarning
source: This action cannot be undone.
ur: یہ عمل واپس نہیں لیا جا سکتا۔

# cancelReasonLabel
source: Cancellation Reason
ur: منسوخی کی وجہ

# saleCancelledSuccess
source: Sale cancelled successfully.
ur: سیل کامیابی سے منسوخ ہو گئی۔

# saleAlreadyCancelled
source: This sale has already been cancelled.
ur: یہ سیل پہلے ہی منسوخ کی جا چکی ہے۔

source: Completed
ur: مکمل شدہ

source: Cancelled
ur: منسوخ شدہ

# invalidPrice
source: Price must be greater than zero
ur: قیمت صفر سے زیادہ ہونی چاہیے

# invalidQuantity
source: Quantity must be greater than zero
ur: مقدار صفر سے زیادہ ہونی چاہیے

source: Insufficient stock
ur: ناکافی اسٹاک

source: Out of stock
ur: اسٹاک ختم

source: Product not found
ur: پروڈکٹ نہیں ملا

source: Credit Limit Exceeded
ur: کریڈٹ حد سے تجاوز

source: Customer credit limit
ur: گاہک کی کریڈٹ حد

# creditLimitWarning
source: This sale will exceed the customer's credit limit. Please collect payment or increase credit limit.
ur: یہ فروخت گاہک کی کریڈٹ حد سے تجاوز کرے گی۔ براہ کرم ادائیگی وصول کریں یا کریڈٹ حد بڑھائیں۔

source: Processing sale...
ur: فروخت پر کارروائی جاری ہے...

source: Exceeded by
ur: سے تجاوز

source: Increase Limit
ur: حد بڑھائیں

source: Continue Anyway
ur: پھر بھی جاری رکھیں

source: Update Credit Limit
ur: کریڈٹ حد اپ ڈیٹ کریں

source: New Credit Limit
ur: نئی کریڈٹ حد

# suggestedLimit
source: Suggested based on current sale
ur: موجودہ فروخت کی بنیاد پر تجویز کردہ

source: Invalid amount
ur: غلط رقم

# creditLimitUpdated
source: Credit limit updated successfully
ur: کریڈٹ حد کامیابی سے اپ ڈیٹ ہوگئی

# creditLimitWarningMsg
source: The current sale exceeds the customer's credit limit of {limit}. You can either collect payment now or increase the credit limit.
ur: موجودہ فروخت گاہک کی کریڈٹ حد {limit} سے تجاوز کر گئی ہے۔ آپ یا تو ابھی ادائیگی وصول کر سکتے ہیں یا کریڈٹ حد بڑھا سکتے ہیں۔

source: Excess Amount
ur: زیادہ رقم

source: Increase Credit Limit
ur: کریڈٹ حد بڑھائیں

source: Invalid limit
ur: غلط حد

source: Update Limit
ur: حد اپ ڈیٹ کریں

source: Save & Print
ur: محفوظ اور پرنٹ کریں

source: Change Due
ur: بقایا رقم

# pendingAmount
source: Pending Credits
ur: باقی رقم

source: Items need restock
ur: اشیاء کی ضرورت ہے

source: Active today
ur: آج فعال

# cannotDeleteBal
source: Cannot delete customer with outstanding balance
ur: موجودہ بیلنس والے گاہک کو حذف نہیں کیا جا سکتا

source: Archived Customers
ur: آرکائیو گاہک

source: Warning
ur: انتباہ

# dashboardTotal
source: Total
ur: کل

# dashboardActive
source: Active
ur: سرگرم

# dashboardArchived
source: Archived
ur: آرکائیو

# balanceShort
source: Bal
ur: بیلنس: {amount}

# searchPlaceholder
source: Search...
ur: گاہک تلاش کریں...

source: Search Archived...
ur: آرکائیو گاہک تلاش کریں...

source: Add Customer
ur: گاہک شامل کریں

# phoneLabel
source: Phone (Unique)
ur: فون نمبر

# addressLabel
source: Address
ur: پتہ

# phoneExistsError
source: Phone number already exists in system
ur: فون نمبر پہلے سے سسٹم میں موجود ہے

source: Archive Now
ur: ابھی آرکائیو کریں

# requiredField
source: is required
ur: یہ فیلڈ ضروری ہے

source: Recent Activities
ur: حالیہ سرگرمیاں

source: No activities yet
ur: ابھی تک کوئی سرگرمی نہیں

source: Payment received
ur: ادائیگی وصول ہوئی

source: Bill created
ur: بل بنایا گیا

source: New customer added
ur: نیا گاہک شامل کیا گیا

source: Stock updated
ur: اسٹاک اپ ڈیٹ ہوا

source: Dashboard
ur: ڈیش بورڈ

source: Pending Credits
ur: باقی رقم

source: System Online
ur: سسٹم آن لائن

source: Database: Connected
ur: ڈیٹا بیس: منسلک

source: System OK
ur: سسٹم ٹھیک ہے

source: Cash Sale
ur: نقد فروخت

source: Urgent
ur: فوری

source: Just now
ur: ابھی

source: min ago
ur: منٹ پہلے

source: hr ago
ur: گھنٹہ پہلے

source: days ago
ur: دن پہلے

# onlyLeft
source: Only {count} {unit} left
ur: صرف {count} {unit} باقی

# activityType
source: Activity
ur: سرگرمی

source: Status
ur: حیثیت

source: Pending
ur: زیر التواء

source: Name
ur: نام

source: No backups found
ur: کوئی بیک اپ نہیں ملا

# backupCreated
source: Backup created successfully!
ur: بیک اپ کامیابی سے بنایا گیا

# backupFailed
source: Failed to create backup
ur: بیک اپ بنانے میں ناکام

source: Backup deleted
ur: بیک اپ حذف ہو گیا

source: Delete failed
ur: حذف کرنا ناکام

source: Restore Backup
ur: بیک اپ بحال کریں

source: Delete Backup
ur: بیک اپ حذف کریں

# restoreConfirm
source: Are you sure you want to restore from
ur: کیا آپ واقعی اس بیک اپ کو بحال کرنا چاہتے ہیں؟

# deleteConfirm
source: Are you sure you want to delete
ur: کیا آپ واقعی اس بیک اپ کو حذف کرنا چاہتے ہیں؟

# restoreWarning
source: This will replace your current database.
ur: انتباہ: بحالی سے موجودہ ڈیٹا ضائع ہو جائے گا!

# restoreSuccess
source: Database restored successfully! App will restart.
ur: بیک اپ کامیابی سے بحال ہو گیا

source: Restore failed
ur: بیک اپ بحال کرنے میں ناکام

# usbExportSetup
source: USB export requires additional setup
ur: USB ایکسپورٹ سیٹ اپ کریں

# preferencesSaved
source: Preferences saved successfully
ur: ترجیحات کامیابی سے محفوظ ہو گئیں

source: Checking for updates...
ur: اپ ڈیٹس کے لیے چیک کر رہا ہے...

source: Never
ur: کبھی نہیں

source: Refresh
ur: ریفرش

# saveChangesSuccess
source: Changes saved successfully
ur: تبدیلی کامیابی سے محفوظ ہو گئی ہے

# fieldRequired
source: Field is required
ur: فیلڈ ضروری ہے

source: No Data Available
ur: کوئی ڈیتا موجود نہں

# dbSize
source: Database Size
ur: ڈیٹا بیس سائز

source: Select Payment Method
ur: ادائیگی کا طریقہ کار

source: Confirm Payment
ur: ادائیگی کنفرم؟
